IDEA StatiCa Open Model
NonConformity Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Non-conformity
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Message.NonConformity
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class NonConformity
Public Class NonConformity
public ref class NonConformity
The NonConformity type exposes the following members.
Constructors
Name | Description
NonConformity
 Constructor
Top
Properties
Name | Description
Guid
 Description of the nonconformity
Severity
 severity of this nonconformity
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace